<template>
  <div class="popup-info">
    <div class="popup-info__header">
      <div class="popup-info__header-close">
        <img @click="closePopup" src="..\assets\vector7.png" />
      </div>
    </div>
    <div class="popup-info__content">
      <h1>Обработка данных</h1>
      <p>1. Что регулирует настоящая политика конфиденциальности</p>
      <p>
        Настоящая политика конфиденциальности (далее — Политика) действует в
        отношении всей информации, включая персональные данные в понимании
        применимого законодательства (далее — «Персональная информация»),
        которую ООО «Гросс маркет» и/или его аффилированные лица, в том числе
        входящие в одну группу с ООО «Гросс маркет» (далее — «Гросс маркет»),
        могут получитьо Вас в процессе использования Вами любых сайтов,
        программ, продуктов и/или сервисов Гросс маркет (далее вместе
        «Сервисы»), информацию о которых Гросс маркет может также получать
        Персональную информацию от своих партнеров (далее — «Партнеры»), сайты,
        программы, продукты или сервисы которых Вы используете (например, от
        рекламодателей Гросс маркет или службами такси). В таких случаях
        передача Персональной информации возможна только в случаях,
        установленных применимым законодательством, и осуществляется на
        основании специальных договоров между Гросс маркет и каждым из
        Партнеров. Пожалуйста, обратите внимание, что использование любого из
        Сайтов и/или Сервисов может регулироваться дополнительными условиями,
        которые могут вносить в настоящую Политику изменения и/или дополнения,
        и/или иметь специальные условия в отношении персональной информации,
        размещенные в соответствующих разделах документов для таких Сайтов /или
        Сервисов.
      </p>
      <p>2. Кто обрабатывает информацию</p>
      <p>
        Для обеспечения использования Вами Сайтов и Сервисов Ваша Персональная
        информация собирается и используется Яндексом, в том числе включая
        общество с ограниченной ответственностью «Гросс маркет», юридическое
        лицо, созданное по законодательству Российской Федерации и
        зарегистрированное по адресу: 123351, Россия, Москва, ул. Гроссова, д.
        12 (ООО «Гросс маркет»), или его аффилированным лицом, предоставляющим
        соответствующий Сервис в иных юрисдикциях. С информацией о том, какое
        лицо предоставляет тот или иной Сервис, Вы можете ознакомиться в
        условиях использования соответствующего Сервиса.
      </p>
      <p>3. Какова цель данной Политики</p>
      <p>
        Защита Вашей Персональной информации и Вашей конфиденциальности
        чрезвычайно важны для Гросс маркета. Поэтому при использовании Вами
        Сайтов и Сервисов Гросс маркет защищает и обрабатывает Вашу Персональную
        информацию в строгом соответствии с применимым законодательством.
      </p>
      <p>4. Какую Персональную информацию о Вас собирает Гросс маркет</p>
      <p>
        Для обеспечения использования Вами Сайтов и Сервисов Ваша Персональная
        информация собирается и используется Яндексом, в том числе включая
        общество с ограниченной ответственностью «Гросс маркет», юридическое
        лицо, созданное по законодательству Российской Федерации и
        зарегистрированное по адресу: 123351, Россия, Москва, ул. Гроссова, д.
        12 (ООО «Гросс маркет»), или его аффилированным лицом, предоставляющим
        соответствующий Сервис в иных юрисдикциях. С информацией о том, какое
        лицо предоставляет тот или иной Сервис, Вы можете ознакомиться в
        условиях использования соответствующего Сервиса.
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: "popupInfo",
  methods: {
    closePopup() {
      this.$emit("closeThisPopup");
    },
  },
};
</script>

<style>
.popup-info {
  background: rgba(64, 64, 64, 0.4);
  display: flex;
  justify-content: center;
  align-items: center;
  position: sticky;
  top: 0;
  /* bottom: 0; */
  flex-direction: column;
  height: 100vh;
  z-index: 10;
  padding: 90px;
}
.popup-info__content {
  background-color: #fff;
  z-index: 10;
  width: 80vw;
}

.popup-info__header {
  background-color: #fff;
  z-index: 9;
  width: 80vw;
  text-align: end;
}

.popup-info__header-close {
  z-index: 10;
}

@media screen and (max-width: 375px) {
  .popup-info {
    background: rgba(64, 64, 64, 0.4);
    display: flex;
    justify-content: center;
    align-items: center;
    position: sticky;
    top: 0;
    /* bottom: 0; */
    flex-direction: column;
    height: 280vh;
    z-index: 10;
    padding: 90px;
  }
}
</style>